import aboutImage1 from "../../img/about/1.jpeg";
import aboutImage2 from "../../img/about/2.jpeg";
import aboutImage3 from "../../img/about/3.jpg";
import { useState } from "react";
import { Womans } from "../../models/womans";
export const AboutContainer: React.FC = () => {
  const [name, setName] = useState<Womans>(Womans.MINADORA);

  return (
    <div style={{ marginTop: "50px" }}>
      <div
        className="about section-padding bottom-cl-border-about section-padding-mob"
        data-scroll-index={1}
      >
        <div className="container">
          <div className="row">
            <div className="col-lg-5 order-2-mob">
              <div className="img-mons sm-mb30">
                <div className="row">
                  <div className="col-md-5 cmd-padding valign">
                    <div className="img1 wow image" data-wow-delay=".5s">
                      <img src={(aboutImage1 as any).src} alt="sss" />
                    </div>
                  </div>
                  <div className="col-md-7 cmd-padding">
                    <div className="img2 wow image" data-wow-delay=".3s">
                      <img src={(aboutImage2 as any).src} alt="sa" />
                    </div>
                    <div className="img3 wow image" data-wow-delay=".8s">
                      <img src={(aboutImage3 as any).src} alt="sa" />
                    </div>
                  </div>
                </div>
              </div>
            </div>
            <div className="col-lg-6 offset-lg-1 valign">
              <div className="content">
                <div className="sub-title">
                  <h6 className="text-white">რე:სქულის შესახებ</h6>
                </div>
                <h3
                  className="main-title wow text-white"
                  data-splitting
                  style={{ position: "relative" }}
                >
                  {" "}
                  <span className="r-count">1</span>ჩვენ შესახებ
                </h3>
                <p className="wow txt" data-splitting></p>
                <p className="line-bottom">
                  {" "}
                  რე:სქული რე:ინვენთ ჰოლდინგის საგანმანათლებლო პლატფორმაა და
                  ფარავს 9-დან 15-წლამდე ასაკს. ეს არის არაფორმალური განათლების
                  სივრცე, სადაც თავად ინოვაციური პროექტების შემქმნელები,
                  პრაქტიკოსი კვალიფიციური მენტორები ასწავლიან ბავშვებს ყველაზე
                  მოთხოვნად ტექნოლოგიურ პროფესიებს. აქ სრულად ვპასუხობთ მომავლის
                  გამოწვევებს და 21-ე საუკუნის შრომის ბაზრის მოთხოვნებს.
                  <br />
                  რე:სქულის თბილისის ფილიალი ფუნქციონირებს 2022 წლიდან. 2023
                  წლიდან თბილისის ფილიალს შეემატა ბათუმის ფილიალი. რე:სქულში
                  სწავლება ხორციელდება ბავშვების ორ 9-11 და 12-15 ასაკობრივ
                  ჯგუფებზე ოთხი ძირითადი მიმართულებით:
                  <br />
                  <br />
                  • ვებ პროგრამირება (FRONT-END) – 9 წლიდან,
                  <br />
                  • თამაშების შექმნა- 12 წლიდან,
                  <br />
                  • UI/UX დიზაინი- 12 წლიდან,
                  <br />
                  • გრაფიკული და ვებ დიზაინი - 9 წლიდან.
                  <br />{" "}
                  <h3
                    className="main-title wow text-white"
                    data-splitting
                    style={{ position: "relative" }}
                  >
                    {" "}
                    {/*<div style={{marginTop:"25px"}}>ჩვენი მანტრაა - შენ შეგიძლია!</div>*/}
                  </h3>
                </p>

                {/* <p> აჩქარებული პროგრესის შედეგია ის, რომ ტექნოლოგიურ განვითარებას, საგანმანათლებლო სისტემა
                                ახლოსაც კი ვერ მიჰყვება. შედეგად, საზოგადოების დიდ ნაწილს არ აქვს ინფორმაცია იმაზე, თუ
                                რა სისტემებით იმართება დღევანდელი ტექნოლოგიური სამყარო. შესაბამისად ჩვენნაირ ადამიანებს
                                უწევთ დამოუკიდებელი სასწავლო სივრცეების შექმნა. </p>
                            <p> უფრო მეტიც, მშობლებისა და მენტორების უმეტესობამ დაკარგა უნარი ურჩიოს სხვებს, თუ რა
                                ტექნოლოგიური მიმართულებების ცოდნაა აუცილებელი თანამედროვე სამყაროში აქტიური
                                მონაწილეობისთვის. შესაბამისად, ეს ადამიანები ტექნოლოგიების მხოლოდ მომხმარებლები ხდებიან
                                (გადახდების, დაჯავშნის, შესყიდვებისა და სხვა პლატფორმების) და მათ მიერ შექმნილ სარგებელს
                                ვერ იღებენ. </p> */}
                {/* <p> დღეს, ყველაზე დიდ დოვლათს ტექნოლოგიური კომპანიები ქმნიან და მომავალში ეს კიდევ უფრო
                                თვალსაჩინო გახდება. უფრო მეტიც, არატექნოლოგიური კომპანიებიც კი, ცდილობენ ტექნოლოგიურ
                                კომპანიებად გადაიქცნენ, რომ შეძლონ თანამედროვე სამყაროში კონკურენტუნარიანობის
                                შენარჩუნება. ამის კარგი მაგალითია ბანკები, არამარტო საქართველოში, არამედ მთელი მსოფლიო
                                მასშტაბით.</p>
                            <p> ჩვენი მანტრა - შენც შეგიძლია! </p> */}
              </div>
            </div>
          </div>
          <div className="row">
            <div className="col-lg-5 valign">
              <div className="content">
                <div className="sub-title">
                  <h6 className="text-white">რე:სქულის შესახებ</h6>
                </div>
                <h3
                  className="main-title wow text-white"
                  data-splitting
                  style={{ position: "relative" }}
                >
                  {" "}
                  <span className="r-count">2</span>რატომ რე:სქული?
                </h3>
                <p className="wow txt" data-splitting></p>
                <p className="line-bottom">
                  {" "}
                  ჩვენ ვფიქრობთ, რომ მხოლოდ ტექნოლოგიების ცოდნა არ არის
                  საკმარისი პროფესიული სრულყოფისა და წარმატების მიღწევისთვის.
                  რე:სქული - ეს არის ერთადერთი სივრცე, სადაც ტექნოლოგიური
                  განათლების პარალელურად, ბავშვებს ვუვითარებთ ყველა იმ საჭირო
                  უნარ-ჩვევას, რაც მათ წარმატების მიღწევაში დაეხმარებათ. აქ,
                  გარდა ტექნოლოგიური მოდულებისა, ბავშვებს ვასწავლით:
                  კიბერუსაფრთხოებას, ცხოვრების დაგეგმვას, ბიზნესის დაწყებას,
                  ემოციურ ინტელექტს, სტრეს მენეჯმენტს, ChatJPT-ის სწორ
                  გამოყენებას, რობოტიკას, ჯანსაღი ცხოვრების წესს, ონლაინ
                  სამყაროსთან ბალანსს, ფულის შოვნის გზებს ტექნოლოგიებით, pitch
                  deck - ის მომზადებას და ინვესტიციების მოზიდვას, ერთი სიტყვით,
                  იმ ყველაფერს, რაც, თანამედროვე სამყაროში წარმატების
                  მიღწევისთვის აუცილებელია.
                  <br />
                  <br />
                  აქ სასწავლო პროცესს მენტორებთან ერთად განათლების ფსიქოლოგები
                  წარმართავენ და ბავშვებისთვის ინკლუზიურ გარემოს ქმნიან.
                  რე:სქულში სწავლება ბავშვებზე მორგებული თანამედროვე
                  მეთოდოლოგიის გამოყენებით მიმდინარეობს.{" "}
                  <h3
                    className="main-title wow text-white"
                    data-splitting
                    style={{ position: "relative" }}
                  >
                    {" "}
                    {/*<div style={{marginTop:"25px"}}>ჩვენი მანტრაა - შენ შეგიძლია!</div>*/}
                  </h3>
                </p>

                {/* <p> აჩქარებული პროგრესის შედეგია ის, რომ ტექნოლოგიურ განვითარებას, საგანმანათლებლო სისტემა
                                ახლოსაც კი ვერ მიჰყვება. შედეგად, საზოგადოების დიდ ნაწილს არ აქვს ინფორმაცია იმაზე, თუ
                                რა სისტემებით იმართება დღევანდელი ტექნოლოგიური სამყარო. შესაბამისად ჩვენნაირ ადამიანებს
                                უწევთ დამოუკიდებელი სასწავლო სივრცეების შექმნა. </p>
                            <p> უფრო მეტიც, მშობლებისა და მენტორების უმეტესობამ დაკარგა უნარი ურჩიოს სხვებს, თუ რა
                                ტექნოლოგიური მიმართულებების ცოდნაა აუცილებელი თანამედროვე სამყაროში აქტიური
                                მონაწილეობისთვის. შესაბამისად, ეს ადამიანები ტექნოლოგიების მხოლოდ მომხმარებლები ხდებიან
                                (გადახდების, დაჯავშნის, შესყიდვებისა და სხვა პლატფორმების) და მათ მიერ შექმნილ სარგებელს
                                ვერ იღებენ. </p> */}
                {/* <p> დღეს, ყველაზე დიდ დოვლათს ტექნოლოგიური კომპანიები ქმნიან და მომავალში ეს კიდევ უფრო
                                თვალსაჩინო გახდება. უფრო მეტიც, არატექნოლოგიური კომპანიებიც კი, ცდილობენ ტექნოლოგიურ
                                კომპანიებად გადაიქცნენ, რომ შეძლონ თანამედროვე სამყაროში კონკურენტუნარიანობის
                                შენარჩუნება. ამის კარგი მაგალითია ბანკები, არამარტო საქართველოში, არამედ მთელი მსოფლიო
                                მასშტაბით.</p>
                            <p> ჩვენი მანტრა - შენც შეგიძლია! </p> */}
              </div>
            </div>
            <div className="col-lg-6 offset-lg-1 order-2-mob">
              <div className="img-mons sm-mb30">
                <div className="row">
                  <div className="col-md-5 cmd-padding valign">
                    <div className="img1 wow image" data-wow-delay=".5s">
                      <img src={(aboutImage1 as any).src} alt="sss" />
                    </div>
                  </div>
                  <div className="col-md-7 cmd-padding">
                    <div className="img2 wow image" data-wow-delay=".3s">
                      <img src={(aboutImage2 as any).src} alt="sa" />
                    </div>
                    <div className="img3 wow image" data-wow-delay=".8s">
                      <img src={(aboutImage3 as any).src} alt="sa" />
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div className="row">
            <div className="col-lg-5 order-2-mob">
              <div className="img-mons sm-mb30">
                <div className="row">
                  <div className="col-md-5 cmd-padding valign">
                    <div className="img1 wow image" data-wow-delay=".5s">
                      <img src={(aboutImage1 as any).src} alt="sss" />
                    </div>
                  </div>
                  <div className="col-md-7 cmd-padding">
                    <div className="img2 wow image" data-wow-delay=".3s">
                      <img src={(aboutImage2 as any).src} alt="sa" />
                    </div>
                    <div className="img3 wow image" data-wow-delay=".8s">
                      <img src={(aboutImage3 as any).src} alt="sa" />
                    </div>
                  </div>
                </div>
              </div>
            </div>
            <div className="col-lg-6 offset-lg-1 valign">
              <div className="content">
                <div className="sub-title">
                  <h6 className="text-white">რე:სქულის შესახებ</h6>
                </div>
                <h3
                  className="main-title wow text-white"
                  data-splitting
                  style={{ position: "relative" }}
                >
                  {" "}
                  <span className="r-count">3</span>რე:სქულის პროექტები:
                </h3>
                <p className="wow txt" data-splitting></p>
                <p className="line-bottom">
                  {" "}
                  1. რე:სქულმა სოციალური პასუხისმგებლობის ფარგლებში და
                  ოკუპირებულ ტერიტორიებთან ნდობის აღდგენის მიმართულებით
                  მნიშვნელოვანი ვალდებულება აიღო და გალში მცხოვრები
                  ახალგაზრდების პირველ ნაკადს ვებ პროგრამირების უფასო, სამთვიანი
                  ინტენსიური კურსი გაატარა. ახალგაზრდებმა სწავლა 2023 წლის
                  აგვისტოში დაასრულეს.
                  <br />
                  2. რე:სქული, 2023 წლის სექტემბრიდან, თავდაცვის სამინისტროსთან
                  გაფორმებული მემორანდუმის ფარგლებში, სამხედრო მოსამსახურეებისა
                  და თავდაცვის სფეროში მომსახურე ადამიანების შვილებს და მათ
                  ოჯახის წევრებს შეღავათიან სასწავლო პირობებს სთავაზობს.
                  <br />
                  3. რე:სქულს გამოყოფილი აქვს სპეციალური კვოტა სოციალურად
                  დაუცველი ოჯახების ნიჭიერი ახალგაზრდებისთვის და მათ შეღავათიანი
                  ტარიფებით ან უფასოდ ასწავლის.
                  <br />{" "}
                  <h3
                    className="main-title wow text-white"
                    data-splitting
                    style={{ position: "relative" }}
                  >
                    {" "}
                    {/*<div style={{marginTop:"25px"}}>ჩვენი მანტრაა - შენ შეგიძლია!</div>*/}
                  </h3>
                </p>

                {/* <p> აჩქარებული პროგრესის შედეგია ის, რომ ტექნოლოგიურ განვითარებას, საგანმანათლებლო სისტემა
                                ახლოსაც კი ვერ მიჰყვება. შედეგად, საზოგადოების დიდ ნაწილს არ აქვს ინფორმაცია იმაზე, თუ
                                რა სისტემებით იმართება დღევანდელი ტექნოლოგიური სამყარო. შესაბამისად ჩვენნაირ ადამიანებს
                                უწევთ დამოუკიდებელი სასწავლო სივრცეების შექმნა. </p>
                            <p> უფრო მეტიც, მშობლებისა და მენტორების უმეტესობამ დაკარგა უნარი ურჩიოს სხვებს, თუ რა
                                ტექნოლოგიური მიმართულებების ცოდნაა აუცილებელი თანამედროვე სამყაროში აქტიური
                                მონაწილეობისთვის. შესაბამისად, ეს ადამიანები ტექნოლოგიების მხოლოდ მომხმარებლები ხდებიან
                                (გადახდების, დაჯავშნის, შესყიდვებისა და სხვა პლატფორმების) და მათ მიერ შექმნილ სარგებელს
                                ვერ იღებენ. </p> */}
                {/* <p> დღეს, ყველაზე დიდ დოვლათს ტექნოლოგიური კომპანიები ქმნიან და მომავალში ეს კიდევ უფრო
                                თვალსაჩინო გახდება. უფრო მეტიც, არატექნოლოგიური კომპანიებიც კი, ცდილობენ ტექნოლოგიურ
                                კომპანიებად გადაიქცნენ, რომ შეძლონ თანამედროვე სამყაროში კონკურენტუნარიანობის
                                შენარჩუნება. ამის კარგი მაგალითია ბანკები, არამარტო საქართველოში, არამედ მთელი მსოფლიო
                                მასშტაბით.</p>
                            <p> ჩვენი მანტრა - შენც შეგიძლია! </p> */}
              </div>
            </div>
          </div>
        </div>
      </div>
      {/* ==================== End about ==================== */}
      {/* ==================== Start Services ==================== */}

      {/* ==================== End Services ==================== */}
      {/* ==================== Start Services ==================== */}
      {/* <section
        className="services bords section-padding position-re"
        data-scroll-index={2}
      >
        <div className="container">
          <div className="row about-woman">
            <p className="wow txt" data-splitting></p>
            <div className="sec-head  text-center">
              <h6 className="wow fadeIn text-white" data-wow-delay=".5s">
                ქრისტინე{" "}
              </h6>{" "}
              შარაშიძე
            </div>
            <p>
              {" "}
              ქრისტინეს ერაში, ჩვენ შევქმნით მოდულებს, რომელთა საშუალებითაც,
              ჩვენ პარტნიორებს დაწეყებითი დონიდან, საშუალო დონეზე გადავიყვანთ.
              მას შემდეგ, რაც 0-დან 1-მდეს საშუალებით ისინი წარმოდგენას
              შეიქმნიან, თუ რა შესაძლებლობებია ტექში, მათ შემდეგ მივცემთ
              საშუალებას დაფოკუსირდნენ კონკრეტული მიმართულებით. ამ მოდულებს,
              ჩვენ 1-დან 10-მდე კლასიფიკაციას ვაძლევთ.{" "}
            </p>
            <p>
              {" "}
              ამ ეტაპზე, ადამიანებს საშუალება ეძლევათ, მიიღონ სპეციფიკური ცოდნა
              და დაიწყონ სტაჟირების ძებნა, რაშიც ჩვენი გუნდი მათ მრავალმხრივ
              დაეხმარება. ერთი მხრივ, მათ გავუხსნით კარს RE:INVENT-ის
              სტარტაპებში და მეორე მხრივ, დავეხმარებით სხვა კომპანიებთან
              რეკრუტინგის პროცესის წარმატებით გავლაში.{" "}
            </p>
          </div>
        </div>
      </section> */}
      {/* ==================== End Services ==================== */}
      {/* ==================== Start Services ==================== */}
      {/* <section
        className="services bords section-padding position-re"
        data-scroll-index={2}
      >
        <div className="container">
          <div className="row about-woman">
            <p className="wow txt" data-splitting></p>

            <div className="sec-head  text-center">
              <h6 className="wow fadeIn text-white" data-wow-delay=".5s">
                ანა{" "}
              </h6>{" "}
              სოლოღაშვილი
            </div>
            <p>
              {" "}
              ანას ერაში, მთავარი გამოწვევა, სასწავლო პროცესის ჰიბრიდული
              სწავლების (ონლაინ და საკლასო) სისტემაზე გადაყვანაა. ჰიბრიდული
              მოდელის შემოღება პირველი ნაბიჯია სასწავლო მექანიზმის
              მასშტაბირებისთვის, რაც ერთადერთი გზაა რეგიონების მოსაცავად. ჩვენი
              ყველაზე დიდი გამოწვევა ტექ-განათლების მასშტაბირებაა, რის გამოც
              ვცდილობთ საწყის ეტაპზევე შევქმნათ შესამაბისი მექანიზმები.{" "}
            </p>
            <p>
              {" "}
              ამ ეტაპზე, 0-დან 1-მდე მოდულებს, სრულად ვიდეო სემინარებად ვაქცევთ
              და ჩვენ ინვესტორებს, უფრო მაღალი დონის მოდულებზე გადავიყვანთ, რომ
              მონაწილეების დასაქმების შანსები გავზარდოთ.{" "}
            </p>
            <p>
              {" "}
              დამატებით, ანას ერაში შეიქმნება რეკრუტინგის სრულფასოვანი
              მიმართულება, რომელიც პარტნიორებს დაეხმარებათ კარიერის დაგეგმვასა
              და პროფესიული განვითარების მართვაში.{" "}
            </p>
          </div>
        </div>
     
      </section> */}
      {/* ==================== End Services ==================== */}
      {/* ==================== Start Services ==================== */}
      {/* <section
        className="services bords section-padding position-re"
        data-scroll-index={2}
      >
        <div className="container">
          <div className="row about-woman">
            <p className="wow txt" data-splitting></p>
            <div className="sec-head  text-center">
              <h6 className="wow fadeIn text-white" data-wow-delay=".5s">
                ელისაბედ{" "}
              </h6>{" "}
              ნაკაშიძე-ბოლქვაძე
            </div>
            <p>
              {" "}
              ელისაბედის ერაში, ჩვენი გუნდის ძალისხმევა, ბოლომდე მომართული
              იქნება პროფესიული უნარების დახვეწასა და დასაქმებაზე. ამ ეტაპზე
              შეიქმნება 10-დან 50-მდე კლასიფიკაციის მოდულები, რომელთა მთავარი
              ამოცანაც 90% პარტნიორების დასაქმების მიღწევა იქნება. ამ
              კლასიფიკაციის მოდულის დასრულების შემდეგ, შესაძლებელი იქნება
              საშუალო დონის პროფესიონალად დასაქმება. ენობრივი ბარიერისა და სხვა
              პროფესიული უნარების გათვალისწინებით, ჩვენი გუნდი ეცდება საშუალო
              დონის პროგრამისტები საერთაშორისო პროექტებსა და კომპანიებში
              დაასაქმონ.{" "}
            </p>
            <p>
              {" "}
              ასევე, ელისაბედის ერაში, კარიერულ და პროფესიულ სერვისებს, ჩვენ
              სხვა საჭირო უნარების მოდულებსაც დავამატებთ. კოდის წერით,
              შესაძლებელია სამსახურის დაწყება, თუმცა კორპორატიულ და
              ანტრეპრენერულ სამყაროშიც, წარმატების მისაღწევად, ბევრი სხვა უნარია
              საჭირო. შესაბამისად, ჩვენ შევქმნით მოდულებს, რითაც პარტნიორებს
              განვუვითარებთ ისეთ უნარებს, როგორებიცაა ინფორმაციულ
              გადატვირთულობასთან გამკლავება, მნიშვნელოვანი კავშირების დამყარება
              და პირადი დავალებების ეფექტიანად მართვა.{" "}
            </p>
          </div>
        </div>
      
      </section> */}
      {/* <div className="line top left" />
        <div className="line bottom right" /> */}
      {/* ==================== End Services ==================== */}
      {/* ==================== Start Services ==================== */}
      {/* <section
        className="services bords section-padding position-re"
        data-scroll-index={2}
      >
        <div className="container">
          <div className="row about-woman">
            <p className="wow txt" data-splitting></p>
            <div className="sec-head  text-center">
              <h6 className="wow fadeIn text-white" data-wow-delay=".5s">
                ელეონორა{" "}
              </h6>{" "}
              ტერ-ფარსეგოვა-მახვილაძე
            </div>
            <p>
              {" "}
              ელეონორას ერა, რე:ედუქეითის განვითარების ბოლო სტადიაა, რომელიც
              უსასრულოდ გაგრძელდება. ამ ეტაპზე, მთავარი ძალისხმევა ყველა
              სასწავლო მოდულის მასშტაბირებისკენ იქნება მიმართული. განსაკუთრებული
              ყურადღება დაეთმობა, რე:ედუქეითის მასშტაბირებას აფხაზეთსა და
              სამაჩაბლოს რეგიონებში.{" "}
            </p>
            <p>
              {" "}
              ელეონორა მაგალითი იყო იმისა, თუ როგორ შეიძლება ერთი შეხედულებით
              გამოუვალი მდგომარეობა სიმამაცით და მოხერხებულობით დაიძლიოს. 1905
              წლის 17 ოქტომბრის მანიფესტის შემდეგ, ორგანიზაციამ რუსეთის
              სოციალ-დემოკრატიული მუშათა პარტიის ბათუმის კომიტეტის სოხუმის ჯგუფი
              (რომლის ერთ-ერთი ხელმძღვანელი იყო ელეონორა) რეალურად ხელში აიღო
              ქალაქ სოხუმის მმართველობა და ჩაანაცვლა მეფის ხელისუფლების თითქმის
              ყველა სტრუქტურა. ამის გამო 1908 წელს იგი პირველად დააპატიმრეს.
              1917 წლამდე კიდევ სამჯერ იყო დაპატიმრებული. ჩვენც, მსგავსი
              შეუპოვრობით ვუდგებით ჩვენი გაწერილი გეგმების აღსრულებას.{" "}
            </p>
          </div>
        </div>
        <div className="line top right" />
      </section> */}
    </div>
  );
};

export default AboutContainer;
