
export const validateEmail = (email: string) => {
    return String(email)
      .toLowerCase()
      .match(
        /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/
      );
  };



  export const romanNums = ()=>{
    const roman = new Map<number, string>()

    roman.set(1, 'I')
    roman.set(2, 'II')
    roman.set(3, 'III')
    roman.set(4, 'IV')
    roman.set(5, 'V')
    roman.set(6, 'VI')
    roman.set(7, 'VII')
    roman.set(8, 'VIII')
    roman.set(9, 'IX')
    roman.set(10, 'X')
    roman.set(11, 'XI')
    roman.set(12, 'XII')
    roman.set(13, 'XIII')
    roman.set(14, 'XIV')
    roman.set(15, 'XV')
    return roman
  }

  export const getTableName = ()=>{
    const names = new Map<string, string>()

    names.set('users', 'საიტზე რეგისტრირებული მომხმარებლები')
    names.set('students', 'სტუდენტები')
    names.set('mentors', 'მენტორები')
    names.set('module', 'მოდულები')
    names.set('groups', 'ჯგუფები')
    names.set('events', 'დამსწრეები')
    return names
  }



 export function getTokenConfig(csrfToken?: string){
  const token = localStorage.getItem('jwt')
  let config= {
    headers: {
   
      'Authorization': ''
         // 'csrf-token': ''
    },
    param: ''
  }
  if(token && token !=='undefined'){
  
    config.headers.Authorization="Bearer " + JSON.parse(token)
  }
  if(csrfToken){
    // config.headers["csrf-token"] =csrfToken
  }

  
            return config
 }      


 export   const showPickerHandler = (e: any)=>{
  e.target?.showPicker()
}





export const terms_condition_text =`

ვებ-საიტის სარგებლობის,
აგრეთვე მოდულის შესყიდვის განხორციელების წესები და პირობები
შემდეგ გვერდებზე მოცემულია დეტალური ინფორმაცია შპს „რე:ედუქეითი“ (RE:EDUCATE, „ჩვენ“,
„ჩვენს“) შესახებ, აგრეთვე მოცემულია პირობები, რომლებიც არეგულირებენ თქვენ მიერ ვებგვერდით
[reeducate.space] (შემდგომში „ელექტრონულ პლატფორმაზე“) სარგებლობის წესებს, ასევე
მოდულების ყიდვას.
ჩვენს ელექტრონულ პლატფორმაზე ანგარიშის დარეგისტრირებისას, ელ.ფოსტის მისამართზე
მოგეწოდებათ რეგისტრაციის მომენტისათვის მოქმედი დებულებებისა და პირობების ელექტრონული
ვერსია. ჩვენ გირჩევთ, ამობეჭდოთ და შეინახოთ დებულებებისა და პირობების ასლი შემდგომში
გამოყენების მიზნით.
ვებგვერდზე - [reeducate.space], ნებისმიერი მოდულის შესყიდვამდე, გთხოვთ, ყურადღებით გაეცნოთ
კომპანიის მოქმედ დებულებებსა და პირობებს. გთხოვთ, გაითვალისწინეთ, აღნიშნული დებულებები და
პირობები შესაძლოა კომპანიის მიერ შეიცვალოს ცალმხრივად წინასწარი შეტყობინების გარეშე.
დებულებებისა და პირობების მნიშვნელოვანი ცვლილებების შესახებ შეტყობინება შესაძლოა მიიღოთ
თქვენ მიერ რეგისტრირებულ ელ.ფოსტის მისამართზე. დებულებებისა და პირობების განახლებული
ვერსია ყოველთვის იქნება ხელმისაწვდომი ვებგვერდზე.
მოდულის შეძენისას იმოქმედებს მოდულის შეძენის მომენტში არსებული დებულებებისა და პირობების
ვერსია, გარდა იმ შემთხვევებისა, როდესაც ამ დებულებებსა და პირობებში ცვლილებების შეტანა
მოითხოვება კანონის ან სახელმწიფო ხელისუფლების მიერ და ჩვენ შესაძლოა დაგვევალოს ამგვარი
ცვლილებების გავრცელება თქვენ მიერ ადრე განხორციელებულ აქტივობებზე.
ელექტრონულ პლატფორმაზე წვდომითა და მისი გამოყენებით, აგრეთვე მოდულების შეძენით, თქვენ
ადასტურებთ, რომ წაკითხული და გაცნობიერებული გაქვთ დებულებები და პირობები და თანახმა ხართ,
რომ იკისროთ ამ დებულებებით გათვალისწინებული ვალდებულებები.
წინამდებარე დებულებები და პირობები გამარტივებისთვის პირობითად დავყავით ორ თავად:
(i)ელექტრონული პლატფორმით სარგებლობის ზოგადი პირობები და წესები და
(ii)ელექტრონული პლატფორმის მეშვეობით მოდულების შესყიდვის პირობები და წესები.
სარჩევი
თავი N1 - ელექტრონული პლატფორმის გამოყენების პირობები 3
პრეამბულა 3
1. ტერმინთა განმარტებები 3
2. ინფორმაცია კომპანიის შესახებ 4
3. ინფორმაცია ჩვენი მომსახურების შესახებ 5
4. ელექტრონული პლატფორმით სარგებლობის პირობები 5
5. ინტელექტუალური საკუთრების უფლებები 6
6. მომხმარებლის ზოგადი ვალდებულებები 6
7. ჩვენი განცხადებები და გარანტიები 7
8. ბმულები და სოციალური გვერდები 8
9. პერსონალური მონაცემები 8
10. მიმოწერა და კომუნიკაცია 8
თავი N2 -მოდულის შეძენა 9
11. კომპანიის მომსახურების ზოგადი დებულებები 9
12. ანგარიშის რეგისტრაცია 9
13. მოდულის შეძენა 9
14. ფასები და სერვისის მომწოდებლების შეთავაზებები 10
15. გადახდის წესი და საგადახდო საშუალება 10
16. მოდულის გაუქმება 10
17. კომპანიის პასუხისმგებლობის შეზღუდვა 10
18. მოქმედი კანონი, იურისდიქცია და დავების გადაწყვეტა 11
19. დასკვნითი დებულებები 11
თავი N1 - ელექტრონული პლატფორმის გამოყენების პირობები
პრეამბულა
იმდენად რამდენადაც:
i. შპს RE:EDUCATE არის განსხვავებული, შედეგზე ორიენტირებული ახალი სივრცე, სადაც
ასწავლიან ადამიანები, რომლებიც თავიანთ ინდუსტრიაში ერთ-ერთი ყველაზე წარმატებული
პროფესიონალები არიან. მათი არჩევანი RE:EDUCATE-ია, როგორც საუკეთესო გზა დროის
ინვესტირებისთვის და ახალი თაობისთვის უნიკალური პარტნიორობის შესაძლებლობის მიცემისთვის.
შესაბამისად, ადამიანებს, რომლებიც შპს „RE:EDUCATE-ში“ ასწავლიან ვუწოდებთ
„ინვესტორებს“, რადგან სწორედ მათი მხრიდან განხორციელებული დროითი ინვესტიცია ხელს
უწყობს გლობალური ციფრული პროდუქტების შექმნას.
ii. დღევანდელ სამყაროში და განსაკუთრებით ტექ-ინდუსტრიაში, იმდენად სწრაფად იცვლება
ყველაფერი, რომ ერთჯერადად შეძენილი ცოდნით, ადამიანი ვერაფერი ღირებულის შექმნას ვერ
შეძლებს. ამიტომ, ჩვენი მთავარი ამოცანა არა ცოდნის გადაცემა, არამედ სწავლის მიმართ ადამიანების
აზროვნებისა და დამოკიდებულების შეცვლა, რომ ისინი დაუსრულებელ თვით-განათლებაზე
გადავიდნენ. ბევრად უფრო მნიშვნელოვანია იცოდე, თუ როგორ უნდა ისწავლო სწრაფად, ვიდრე
კარგად იცოდე ნებისმიერი ერთი მიმართულება.
iii. შესაბამისად, ადამიანებს ვინც ჩვენთან სწავლობენ, ვეძახით „პარტნიორებს“, რადგანაც ჩვენი
მთავარი საქმიანობა ბევრი ტექ-სტარტაპის შექმნაა. ამასთან, ჩვენ გვჯერა, რომ ადამიანის მიდგომა
სწავლის მიმართ რადიკალურად იცვლება, როდესაც მას, არა როგორც მოსწავლეს, არამედ როგორც
პარტნიორს, ისე უდგები.
ყოველგვარი გაუგებრობის თავიდან ასაცილებლად მხარეები ვთანხმდებით, რომ ტერმინები
„ინვესტორი“
და „პარტნიორი“ არის პირობითი, აღნიშნულ ტერმინებს სამართლებრივი დატვირთვა
და მნიშვნელობა არ გააჩნია და გამოიყენება RE:EDUCATE-ის კონცეფციის მიზნებისთვის.
სამართლებრივად მსმენელს, კომპანიასა და ლექტორს შორის არ ყალიბდება რაიმე საინვესტიციო
ურთიერთობა და არ იდება არანაირი საინვესტიციო შეთანხმება.
1. ტერმინთა განმარტებები
წინამდებარე დებულებებსა და პირობებში ჩვენ მიერ გამოყენებული იქნება ზოგიერთი ტერმინი,
რომელთა მნიშვნელობა განისაზღვრება შემდეგნაირად:
1.1. ანგარიში - ელექტრონული პლატფორმის დახურული/კონფიდენციალური ნაწილი, რომელშიც
მომხმარებელი შედის ელ.ფოსტის მისამართისა და პაროლის მეშვეობით. ანგარიში
გამოიყენება მომხმარებლის მიერ მოდულების შესაძენად. ანგარიში შეიცავს მომხმარებლისა
და ვებგვერდზე მისი აქტივობის შესახებ სხვადასხვა ინფორმაციას, რომელიც მოწოდებულია
თავად მომხმარებლის მიერ (პერსონალური მონაცემები), ან ავტომატურად - ვებგვერდის
მიერ (მოდულების შეძენის ინფორმაცია და.ა.შ.).
1.2. ელექტრონული პლატფორმა – ჩვენი ვებგვერდი.
1.3. ვებგვერდი - ჩვენი ვებგვერდი, დომენით reeducate.space, რომლის მეშვეობითაც
ხელმისაწვდომია 3.1 პუნქტში მითითებული მომსახურება.
1.4. კომპანია/ RE:EDUCATE- შპს „რე:ედუქეითი“/RE:EDUCATE (ს/კ 405511236),
რომელიც დაფუძნებულია საქართველოში და მოქმედებს საქართველოს კანონმდებლობის
შესაბამისად. კომპანია ასევე მოხსენიებული შეიძლება იყოს როგორც „ჩვენ“, „ჩვენი“.
1.5. მოდული - კომპანიის მიერ „პარტნიორისთვის“ შეთავაზებული მოდულები, რომლებიც
შეეხება ტექნოლოგიებს, ინოვაციებს და სხვა მსგავს თემატიკას. მოდულები კატეგორიების
მიხედვით იყოფა: ა) გაცნობით მოდულად; ბ)საბაზისო მოდულად და გ)საშუალო მოდულად.
კომპანიის მითითებითა და გადაწყვეტილებით მოდულების „პარტნიორისთვის“ მიწოდება
მოხდება ჰიბრიდული ფორმით: ონლაინ და აუდიტორული სწავლებით.
1.6. ინვესტორი - პრეამბულის პირველი პუნქტის შესაბამისად, კომპანიის მიერ შერჩეული პირი
(ლექტორი), რომელიც ატარებს მოდულს/კურსს და რომელსაც RE:EDUCATE-ის
კონცეფციის მიზნებისთვის პირობითად ვუწოდებთ „ინვესტორს“.
1.7. პარტნიორი - პრეამბულის მესამე პუნქტის შესაბამისად ნებისმიერი ასაკის პირი, რომელიც
ეთანხმება კომპანიის მიერ შემოთავაზებულ პირობებს და გადის გაცნობით, საბაზისო ან
საშუალო მოდულს და რომელსაც RE:EDUCATE-ის კონცეფციის მიზნებისთვის პირობითად
ვუწოდებთ „პარტნიორს“.
1.8. გაცნობითი მოდული [0-1] - გაცნობითი ეწოდება მოდულს, რომელიც „პარტნიორს“
საშუალებას აძლევს ზოგადად გაეცნოს მოდულის თემატიკას.
1.9. საბაზისო მოდული [1-10] - საბაზისო ეწოდება მოდულს, რომელიც „პარტნიორს“
საშუალებას აძლევს დაეუფლოს სფეროს საფუძვლებს.
1.10. საშუალო მოდული [10-50] - საშუალო ეწოდება მოდულს, რომელიც
„პარტნიორს“ საშუალებს აძლევს დაეუფლოს სფეროს საშუალო საფეხურს. აღნიშნული
საფეხურიდან შესაძლებელია დასაქმება.
1.11. შიგთავსი - ელექტრონულ პლატფორმაზე გამოსახული თუ ხელმისაწვდომი ნებისმიერი
გრაფიკული გამოსახულება, მათ შორის მოდულის შესახებ ინფორმაცია, მოდულის მასალები,
დისტანციური თუ ონლაინ მოდულები, ფოტო, გამოსახულება, ხმა, მუსიკა, ვიდეო, აუდიო,
ტექსტი, ლოგო, ღილაკის სიმბოლო, მონაცემთა ბაზა, დიზაინი, პროგრამული უზრუნველყოფა
და ნებისმიერი სხვა ელემენტი.
2. ინფორმაცია კომპანიის შესახებ
1.1. ელექტრონული პლატფორმის მესაკუთრე და ოპერატორია შპს „RE:EDUCATE“,
საქართველოს კანონმდებლობის შესაბამისად რეგისტრირებული და მოქმედი კომპანია,
რეგისტრირებული იურიდიული მისამართით - ქ. თბილისი, საბურთალოს რაიონი, პავლე
ასლანიდის ქ., N 14, ბ. N15. კომპანია რეგისტრირებულია საჯარო რეესტრის ეროვნულ
სააგენტოში საიდენტიფიკაციო ნომრით - 405511236.
1.2. გთხოვთ, შეკითხვების არსებობისას, მოგვმართოთ შემდეგ საკონტაქტო მონაცემებზე:
● იურიდიული მისამართი: ქ. თბილისი, საბურთალოს რაიონი, პავლე ასლანიდის ქ., N 14,
ბ. N15;
● ფაქტობრივი მისამართი: თბილისი ცენტრალი, რე:ინვენთის სათაო ოფისი.
● ტელეფონი: +995 599 773 588
● ელ.ფოსტის მისამართი: contact@reeducate.space
3. ინფორმაცია ჩვენი მომსახურების შესახებ
2.1. ჩვენ გთავაზობთ ელექტრონულ პლატფორმას, რომლის მეშვეობითაც შეგიძლიათ შეიძინოთ და
გაიაროთ კომპანიის მიერ შემოთავაზებულ მოდულებს.
2.2. გთხოვთ გაითვალისწინოთ, რომ მოდულების შესყიდვისთვის შესაძლოა აუცილებელია
კომპანიის ვებგვერდზე reeducate.space გავლილი გქონდეთ რეგისტრაცია.
2.3. გთხოვთ გაითვალისწინოთ, რომ ინვესტორის ვინაობას ცალმხრივად განსაზღვრავს კომპანია
და უფლებამოსილია მოდულის მიმდინარეობისას ნებისმიერ დროს ცალმხრივად შეცვალოს
ინვესტორი.
2.4. მოდულის სილაბუსის, მასალის, სასწავლო პროგრამის/მეთოდიკის შერჩევას ახორციელებს
ინვესტორი. ამდენად, მოდულის ხარისზე სრული პასუხისმგებლობა ეკისრება ინვესტორს და
არა კომპანიას.
2.5. კომპანია არ იძლევა გარანტიას, რომ მის მიერ შეთავაზებული მოდული სრულად და
ამომწურავად ფარავს მოდულის თემატიკას. კომპანია არ იძლევა გარანტიას პარტნიორის მიერ
მოდულის მასალის ათვისების სისწრაფეზე და გამოყენებადობაზე.
2.6. ჩვენ ცალმხრივად განვსაზღვრავთ სერტიფიკატის გაცემის კრიტერიუმებსა და წინაპირობებს.
2.7. ჩვენ უფლებამოსილნი ვართ გავაუქმოთ მოდული თუ არ მოგროვდა პარტნიორების საჭირო
რაოდენობა (რომელსაც ასევე ცალმხრივად განსაზღვრავს კომპანია), აგრეთვე უფლება გვაქვს
ფაქტობრივი გარემოებების გათვალისწინებით შევცვალოთ მოდულის დაწყების თარიღი.
4. ელექტრონული პლატფორმით სარგებლობის პირობები
3.1. ელექტრონული პლატფორმით სარგებლობის წინამდებარე პირობები უკავშირდება თქვენ მიერ
RE:EDUCATE -ის ელექტრონულ პლატფორმაზე წვდომასა და ნებისმიერი სახით
სარგებლობას, ისევე, როგორც თქვენ მიერ შეძენილ მოდულებს, მიუხედავად იმისა, თუ რა
საშუალებით გაქვთ წვდომა ან რა ტექნოლოგიებსა და მოწყობილობებს იყენებთ ამგვარი
წვდომისათვის.
3.2. ელექტრონულ პლატფორმაზე ნებისმიერი საშუალებით წვდომით, სარგებლობით ან/და
რეგისტრაციით, აგრეთვე, მოდულის შეძენისას თქვენ ადასტურებთ, რომ წაკითხული და
გაცნობიერებული გაქვთ პირობები და თანახმა ხართ აიღოთ შესაბამისი დებულებები.
3.3. ინტერნეტკავშირის/მობილური კავშირის მქონე ნებისმიერი პირისთვის ელექტრონულ
პლატფორმაზე წვდომა უფასოა.
3.4. ჩვენ ვერ ვიძლევით გარანტიას, რომ ჩვენი ელექტრონული პლატფორმა, ჩვენ მიერ
შემოთავაზებული მოდულები ან მისი რომელიმე შიგთავსი ყოველთვის იქნება ხელმისაწვდომი
და შეუფერხებელი. ჩვენ შეგვიძლია წინასწარი შეტყობინების გარეშე შევაჩეროთ, გავაუქმოთ,
შევწყვიტოთ ან/და შევცვალოთ ჩვენი ელექტრონული პლატფორმის ნებისმიერი ნაწილი. ჩვენ
არ დაგვეკისრება რაიმე სახის პასუხისმგებლობა თქვენ წინაშე თუ ჩვენი ელექტრონული
პლატფორმა ნებისმიერი შესაძლო მიზეზით, ნებისმიერ დროს ან ნებისმიერი ვადით გახდება
მიუწვდომელი.
5. ინტელექტუალური საკუთრების უფლებები
4.1. ელექტრონული პლატფორმის, აგრეთვე მისი შიგთავსის შემადგენელი ყველა ელექტრონული
მასალა და ნაწილი, მოდულის მასალები, დაცულია საავტორო უფლებებით, რეგისტრირებული
სასაქონლო ნიშნებით, კომპანიის საფირმო სახელწოდებით და სხვა
ინტელექტუალური/სამრეწველო საკუთრების უფლებებით. ყველა ასეთი უფლებების მქონე ან
შესაბამისი ლიცენზიების მფლობელია კომპანია ან ამგვარი შიგთავსის მომწოდებელი. ყველა
ამგვარი უფლება დაცულია.
6. მომხმარებლის ზოგადი ვალდებულებები
5.1. თქვენ შეგიძლიათ ისარგებლოთ ელექტრონული პლატფორმითა და მოდულებით მხოლოდ
პირადი და კანონიერი მიზნებით.
5.2. თქვენ ელექტრონული პლატფორმით, ისევე როგორც ნებისმიერი შიგთავსით ვერ
ისარგებლებთ:
● იმ ფორმით, რომელიც არღვევს ნებისმიერ მოქმედ ეროვნულ თუ საერთაშორისო
კანონს ან რეგულირებებს;
● იმ ფორმით, რომელიც ხელყოფს, ზღუდავს ან/და აფერხებს სხვა პირის მიერ
ვებგვერდით სარგებლობის/მისი გამოყენების უფლებას;
● ნებისმიერი კომერციული მიზნით;
● თუ შეგნებულად გადასცემთ, გადაგზავნით ან ატვირთავთ ნებისმიერ
მონაცემს/მასალას, რომელიც შეიცავს ვირუსს, ე.წ. „ტროიანებს“, ჯაშუშ პროგრამებს,
ან ნებისმიერ სხვა საზიანო პროგრამებს ან კოდებს, რომელთა მიზანია კომპიუტერულ
პროგრამებსა და მოწყობილობაზე უარყოფითი ზეგავლენა;
● თუ გადასცემთ ან უზრუნველყოფთ ნებისმიერი არასასურველი ან არასანქცირებული
სარეკლამო ან წამახალისებელი ან ნებისმიერი სხვა ფორმის წამაქეზებელი
გზავნილის (სპამის) გადაცემას.
5.3. თქვენ ასევე თანახმა ხართ, რომ:
● ჩვენი წინასწარი წერილობითი თანხმობის გარეშე და თქვენი პირადი სარგებლობის
მიზნის გარდა, არ განახორციელებთ ელექტრონული პლატფორმის, მოდულების,
მოდულის მასალების თუ ელექტრონული პლატფორმის შემადგენელი კომპიუტერული
კოდებისა და ელემენტების კოპირებას, რეპროდუცირებას, კადრირებას, ხელახლა
გამოქვეყნებას, ჩამოტვირთვას, ბეჭდვას, განთავსებას, განმეორებით განთავსებას,
მაუწყებლით გადაცემას, ჩაწერას, გადაცემას, გასაჯაროებას, ბმულით დაკავშირებას,
ჰაიპერბმულით (deep link) დაკავშირებას ან დისტრიბუციას ნებისმიერი სახით;
● არ შეცვლით ან რაიმე სახით არ გაავრცელებთ ვებგვერდის/მოდულის შიგთავსის
ცვლილებებს, მათ შორის და არა მხოლოდ RE:EDUCATE-ის ლოგოებისა და
სასაქონლო ნიშნების აღებას;
● არ დააზიანებთ, არ შეაფერხებთ ან ზემოქმედებას არ მოახდენთ ამ ელექტრონული
პლატფორმის, მისი შიგთავსის ან ნებისმიერი დაკავშირებული ქსელის ან პროგრამის
ნებისმიერი ნაწილის უსაფრთხოებაზე;
● არ განათავსებთ რაიმე სახის თაღლითურ შეკვეთებს.
5.4. ჩვენ უფლებას ვიტოვებთ, დაუყოვნებლივ შევუზღუდოთ/დავუბლოკოთ ნებისმიერ
მომხმარებელს ვებგვერდზე წვდომა, დავხუროთ ამ დებულებების დამრღვევი ნებისმიერი
რეგისტრირებული მომხმარებლის ანგარიში, გავაუქმოთ მოდულები და შეწყვიტოთ
მომსახურების გაწევა.
7. ჩვენი განცხადებები და გარანტიები
6.1. ჩვენ გონივრულ ძალისხმევას გამოვიყენებთ იმისათვის, რომ უზრუნველვყოთ ზუსტი, სრული
და განახლებული შიგთავსის მოწოდება. კონკრეტულ დროს ელექტრონულ პლატფორმაზე
კონკრეტული მოდულის არსებობა არ გულისხმობს ან გარანტიას არ იძლევა, რომ აღნიშნული
მოდული იქნება ხელმისაწვდომი. ჩვენ უფლებას ვიტოვებთ, რომ ნებისმიერ დროს შევწყვიტოთ
ნებისმიერი სერვისის მიმწოდებლის ელექტრონულ პლატფორმაზე განთავსება.
6.2. მოქმედი კანონმდებლობით ნებადართულ ფარგლებში RE:EDUCATE პასუხისმგებლობას
იხსნის ყველანაირ განცხადებებსა და გარანტიებზე, რომელიც გამოხატული ან ნაგულისხმევია
მოდულის სიზუსტესთან და ხარისხთან დაკავშირებით.
6.3. მოდულის აღწერასთან და/ან ფასებთან დაკავშირებით შეცდომების ან ელექტრონული
პლატფორმაზე ამგვარი მოდულის აღწერაში შესაბამისი მონაცემების არარსებობის
შემთხვევებში RE:EDUCATE იტოვებს უფლებას გამოასწოროს ეს შეცდომები და შემდგომ
გააუქმოს ან შეცვალოს. RE:EDUCATE გონივრული ძალისხმევის ფარგლებში ეცდება
უზრუნველყოს, რომ ელექტრონული პლატფორმა თავისუფალი იყოს ვირუსებისა და სხვა მავნე
ან საზიანო შიგთავსისაგან. თუმცა, ჩვენი რეკომენდაციაა, ელექტრონული პლატფორმის და
მის შიგთავსზე უსაფრთხო წვდომის უზრუნველსაყოფად დაიცვათ სიფრთხილის ზომები,
რადგან ვერ მოგცემთ გარანტიას, რომ ამ პლატფორმით სარგებლობა არ გამოიწვევს თქვენი
კომპიუტერის ან სხვა მოწყობილობის დაზიანებას. მოქმედი კანონმდებლობით
გათვალისწინებული შემთხვევების გარდა, RE:EDUCATE-ს არ დაეკისრება ნებისმიერი
პირის მიმართ პასუხისმგებლობა ნებისმიერ ზარალზე ან დაზიანებაზე, რომელიც აღნიშნულ
პირებს შეიძლება მიადგეთ ვირუსის ან სხვა მავნე ან საზიანო შიგთავსის გამო, რომელთანაც
მათ ჰქონდათ წვდომა ელექტრონულ პლატფორმასთან ან მისი საშუალებით.
8. ბმულები და სოციალური გვერდები
7.1. ელექტრონული პლატფორმა შესაძლოა შეიცავდეს სხვა ვებგვერდების ბმულებს, რომლებიც
არ კონტროლდება RE:EDUCATE-ს მიერ. ამგვარი ბმულები მოცემულია მხოლოდ
მომხმარებლის დასახმარებლად ან ინფორმაციის გასაზიარებლად და აღნიშნული არ უნდა
იქნას აღქმული ჩვენ მიერ ამგვარი ვებგვერდების მხარდაჭერად.
7.2. ჩვენ არ ვიღებთ რაიმე პასუხისმგებლობას ჩვენს ელექტრონულ პლატფორმასთან
დაკავშრებული ვებგვერდების შიგთავსზე. ჩვენ არ დაგვეკისრება პასუხისმგებლობა რაიმე
სახის ზიანზე ან დანაკარგზე, რომელიც შეიძლება წარმოიშვას თქვენ მიერ მათი
სარგებლობის შემთხვევაში.
7.3. წინამდებარე ელექტრონული პლატფორმის პირობები ასევე არეგულირებს თქვენს ნებისმიერ
განცხადებას, განთავსებულს RE:EDUCATE-თან დაკავშირებული ნებისმიერი მესამე მხარის
ვებგვერდზე ან ჩვენი ფეისბუქის, ტვიტერის, პინტერესტის, იუთუბის ან სოციალური ქსელის
გვერდებზე. ნებისმიერი მესამე მხარის სოციალური ქსელის ვებგვერდზე განთავსებული
ყველა კომენტარი, გამოსახულება, ვიდეო ან ნებისმიერი სხვა სახის მასალა უნდა
აკმაყოფილებდეს მოცემულ პირობებსა და მესამე მხარის სოციალური ქსელის ვებგვერდით
სარგებლობის შესაბამის პირობებს.
9. პერსონალური მონაცემები
8.1. თქვენ მიერ მოწოდებული პერსონალური მონაცემები, შესაძლებელია დამუშავდეს კომპანიის
მომსახურების გაუმჯობესების, მოდულების/ინვესტორის შეცვლისა თუ სხვა ნებისმიერი მათ
შორის მარკეტინგული მიზნებისთვის. წინამდებარე დოკუმენტზე დათანხმებით იგულისხმება,
რომ თქვენ აღნიშნულ პირობაზე აცხადებთ თანხმობას.
10. მიმოწერა და კომუნიკაცია
9.1. თქვენსა და RE:EDUCATE-ს შორის კომუნიკაცია, შეტყობინებების, მოთხოვნების,
პრეტენზიების ჩათვლით, განხორციელდება ძირითადად ელექტრონული საშუალებებით -
ვებგვერდზე შეტყობინებების განთავსებით ან ელ.ფოსტაზე შეტყობინებით. თქვენ ეთანხმებით
კომუნიკაციის ამ ელექტრონული საშუალებების გამოყენებას და აცნობიერებთ, რომ
RE:EDUCATE-ს მიერ თქვენთვის ელექტრონული საშუალებებით მოწოდებული ყველა
ხელშეკრულება, შეტყობინება, ინფორმაცია და სხვა კომუნიკაცია აკმაყოფილებს წერილობითი
დოკუმენტისათვის დადგენილ ყველა სამართლებრივ მოთხოვნას.
თავი N2 - მოდულის შეძენა
11. კომპანიის მომსახურების ზოგადი დებულებები
10.1. წინამდებარე დოკუმენტით გათვალისწინებული დებულებები და პირობები მოქმედებს თქვენ
მიერ reeducate.space ვებგვერდის მეშვეობით განთავსებულ შეძენილ მოდულებთან
დაკავშირებით, იმისდამიუხედავად თუ რა სახის, რა მოწყობილობის მეშვეობით გაქვთ წვდომა
ელექტრონულ პლატფორმასთან.
10.2. ჩვენი ელექტრონული პლატფორმაზე წვდომით, დათვალიერებით და გამოყენებით ნებისმიერი
მოდულის შეძენით, თქვენ ადასტურებთ, რომ გაეცანით, გააცნობიერეთ და ეთანხმებით
წინამდებარე დებულებებისა და პირობების სრულად მოქმედებას.
12. ანგარიშის რეგისტრაცია
11.1. მოდულის შესაძენად თქვენ ჩვენთან უნდა გახსნათ/გააქტიუროთ ანგარიში. რეგისტრაციის
დროს მოგეთხოვებათ თქვენ შესახებ გარკვეული პირადი დეტალების მოწოდება, რომელიც მათ
შორის მოიცავს სახელსა და გვარს, ტელეფონის ნომერს, ელ. ფოსტას. გთხოვთ დარწმუნდეთ,
რომ ყველა პერონალური მონაცემი უტყუარი, ზუსტი და სრულია. თქვენი პირადი მონაცემების
განახლება ან კორექტირება ნებისმიერ დროს შეგეძლებათ თქვენს ანგარიშზე წვდომით.
11.2. ანგარიშის რეგისტრაციისას, თქვენივე ანგარიშის დაცვის მიზნით, მოგეთხოვებათ პაროლის
უზრუნველყოფა. თქვენ მიერ შედგენილი ანგარიშის პაროლი უნდა იყოს უნიკალური და დაცული.
თქვენ პასუხისმგებელი ხართ თქვენი ანგარიშის პაროლის კონფიდენციალურობის
შენარჩუნებასა და თქვენი ანგარიშის მეშვეობით განხორციელებულ ნებისმიერ აქტივობაზე.
RE:EDUCATE არ იღებს პასუხისმგებლობას ნებისმიერი პირის მიმართ ნებისმიერ ზარალზე ან
ზიანზე, რომელიც შესაძლოა წარმოიშვას იმ შემთხვევაში, თუ ვერ უზრუნველყოფთ თქვენი
პაროლის ან ანგარიშის დაცვას.
11.3. თუ იცით ან ეჭვი გაქვთ, რომ დარღვეულია თქვენი პაროლის ან ანგარიშის უსაფრთხოება, ან
ხდება მათი არამართლზომიერი გამოყენება, გთხოვთ, დაუყოვნებლივ შეატყობინოთ ამის
შესახებ RE:EDUCATE-ს.
13. მოდულის შეძენა
12.1. თქვენ თავად ირჩევთ რა მოდულის შეძენა გსურთ, გთხოვთ მოდულის არჩევამდე დეტალურად
გაეცნოთ მოდულის აღწერილობას, განრიგსა და საფასურს. თქვენ ვალდებული იქნებით
მოდულის საფასური გადაიხადოთ სრულად წინასწარ. მხარეები შეიძლება შეთანხმდნენ
მოდულის საფასურის ეტაპობრივ გადახდაზე, რომელიც შეიძლება შეთანხმდეს, როგორც
წერილობითი ფორმით ასევე იმეილებზე განხორცილებული კომუნიკაციით.
12.2. ელექტრონულ პლატფორმაზე განთავსებული ინფორმაცია არის მოწვევა ოფერტზე და არ არის
ოფერტი. ოფერტი კეთდება, როდესაც თქვენ თქვენთვის სასრუველი მოდულის არჩევის ღილაკს
დააწვებით. თუმცა, გარიგება დადებულად არ ჩაითვლება იქამდე, ვიდრე ჩვენგან არ მიიღებთ
შეტყობინებას და თქვენ ხელს არ მოაწერთ შესაბამის შეთანხმებას.
12.3. იმისათვის, რომ სათანადოდ შეავსოთ და უზრუნველყოთ მოდულის შეძენა, თქვენ უნდა
გამოიყენოთ სწორი ელექტრონული ფოსტის მისამართი. ჩვენ არ ვართ პასუხისმგებელი და არ
გვაქვს ვალდებულება გადავამოწმოთ ნებისმიერი არასწორი ან არასწორად დაწერილი
ელექტრონული ფოსტის მისამართი ან არასწორი ტელეფონის ან საკრედიტო ბარათის ნომერი.
12.4. მოდულების მუდმივი განახლების, ტარიფების და ხელმისაწვდომობის კორექტირების გამო,
ჩვენ გირჩევთ გააკეთოთ ეკრანის ამონაბეჭდები (ე.წ. სქრინები).
14. ფასები და სერვისის მომწოდებლების შეთავაზებები
13.1. თუკი ჩვენ მიერ ელექტრონულ პლატფორმაზე სხვაგვარად არ იქნება მითითებული, ჩვენს
ელექტრონულ პლატფორმაზე სერვისის მომწოდებლების მიერ შემოთავაზებული ფასები
ნაჩვენებია დღგ-სა და ყველა სხვა გადასახადის, ჩათვლით. საგადახდო მომსახურების
საკომისიო (ასეთის არსებობის შემთხვევაში) შეიძლება დაემატოს საბოლოო ფასს,
შესაბამისად თქვენ მიერ მოდულის საფასურის გადახდისას გადასახდელი ოდენობა შეიძლება
შედგებოდეს შემდეგი ელემენტებისგან: მოდულის საფასური + საგადახდო მომსახურების
საკომისიო (ასეთის არსებობის შემთხვევაში).
15. გადახდის წესი და საგადახდო საშუალება
14.1. თქვენ ვალდებულნი ხართ მოდულის საფასური სრულად გადაიხადოთ წინასწარ, ან მხარეთა
მიერ შეთანხმებული მოდულის საფასურის ეტაპობრივ გადახდის შესაბამისი გრაფიკით,
წინააღმდეგ შემთხვევაში ჩვენ მოდულების მოწოდებას არ განვახორციელებთ.
16. მოდულის გაუქმება
15.1. თქვენ უფლება გაქვთ მოდულის დაწყებიდან 14 (თოთხმეტი) დღის ვადაში მიმართოს კომპანიას
და მოითხოვოთ მოდულის გაუქმება. ამ შემთხვევაში კომპანიამ შესაძლოა მომსახურების
გაუმჯობესების მიზნით მოგთხოვოთ მოდულის გაუქმების მიზეზის მიწერა. მოდულის გაუქმების
შემთხვევაში თქვენ უკან გიბრუნდებათ გადახდილი თანხა.
17. კომპანიის პასუხისმგებლობის შეზღუდვა
16.1. კომპანია თავისუფლდება ყველანაირი პასუხისმგებლობისგან, რაც შესაძლოა კომპანიას
ეკისრებოდეს პარტნიორის მიერ მოდულის ათვისების სისწრაფესა და გამოყენებადობაზე.
აგრეთვე კომპანია არ იღებს გარანტიას, რომ მის მიერ შემოთავაზებული მოდული
სრულყოფილად ფარავს მოდულის თემატიკასთან დაკავშირებულ ყველა საკითხს.
16.2. კომპანიას არ ეკისრება არანაირი პასუხისმგებლობა მოდულის სილაბუსზე, მასალებზე თუ
სწავლების მეთოდიკაზე.
16.3. კომპანია თავისუფლდება ყველანაირი პასუხისმგებლობისგან, მათ შორის ნებისმიერი ზიანის
ანაზღაურებისგან, რაც კი პარტნიორმა შესაძლოა მოითხოვოს კომპანიისგან. კომპანიას
პარტნიორის წინაშე არ ეკისრება არანაირი კომპანიის მიერ ვალდებულებების
შეუსრულებლობის ან არაჯეროვნად შესრულების გამო. აგრეთვე კომპანია თავისუფლდება
ნებისმიერი ზიანის/სარჩოს ანაზღაურებისგან, რაც მოდულებზე დასწრებისას პარტნიორს
შესაძლოა მიადგეს. ეს პუნქტი არ ვრცელდება იმ შემთხვევაზე, როდესაც ზიანი კომპანიის
განზრახი ქმედების შედეგად დადგა.
18. მოქმედი კანონი, იურისდიქცია და დავების გადაწყვეტა
17.1. წინამდებარე დებულებები და პირობები რეგულირდება და განიმარტება საქართველოს
მოქმედი კანონმდებლობის შესაბამისად.
17.2. წინამდებარე დებულებებისა და პირობებიდან გამომდინარე ნებისმიერი დავა ან უთანხმოება,
რომლის ურთიერთმოლაპარაკებით გადაწყვეტა შეუძლებელია გადაწყდება საქართველოს
სასამართლოების მიერ.
19. დასკვნითი დებულებები
18.1. თქვენ არ შეგიძლიათ წინადებარე დებულებებითა და პირობებით, აგრეთვე ხელშეკრულებით
გათვალისწინებული თქვენი რომელიმე უფლება ან ვალდებულება მიანიჭოს ან გადასცეთ სხვა
პირს ჩვენი თანხმობის გარეშე.
18.2. ჩვენ შეიძლება წინამდებარე დებულებებითა და პირობებით, აგრეთვე ხელშეკრულებით
გათვალისწინებული ნებისმიერი ჩვენი უფლება ან ვალდებულება გადავაკისროთ, დავუთმოთ
ან ქვეკონტრაქტით გადავცეთ ნებისმიერ მესამე პირს ჩვენი შეხედულებისამებრ იმ პირობით,
რომ მესამე პირი უზრუნველყოფს თქვენ მიმართ იგივე დონის გარანტიების გაცემასა და
პასუხისმგებლობის აღებას. ჩვენი ვალდებულებების გადაკისრება, დათმობა ან
ქვეკონტრაქტით გადაცემა მოხდება მხოლოდ ჩვენი ორმხრივი შეთანხმების საფუძველზე.
18.3. წინამდებარე დებულებებითა და პირობებით გათვალისწინებული ნებისმიერი უფლების
გამოყენებაზე ჩვენ მიერ თავის შეკავება ან გადავადება არ უნდა იქნას აღქმული, როგორც ამ
უფლებაზე უარის თქმა და აღნიშნულმა გავლენა არ უნდა მოახდინოს შემდგომში ჩვენ მიერ ამ
უფლების გამოყენებაზე.
18.4. თუკი წინამდებარე დებულებებისა და პირობების, აგრეთვე ხელშეკრულებით
გათვალისწინებული ნებისმიერი დებულებები/პირობები ბათილად იქნება ცნობილი, უკანონოდ,
აღუსრულებლად, დანარჩენი დებულებები/პირობები რჩება სრულად ძალაში.
18.5. ჩვენ ყოველთვის ღია ვართ ჩვენს ელექტრონულ პლატფორმასთან დაკავშირებით თქვენი
მოსაზრებებისა და უკუკავშირის მიმართ. ნებისმიერ დროს შეგიძლიათ მოგვმართოთ თქვენი
კომენტარებითა და შემოთავაზებებით 2.2 პუნქტში მითითებულ საკონტაქტო მონაცემებზე.`;

const navigate =(url: string)=>{
  window.open(url, '_blank')

}

export const purchaseHandler = (id: string)=>{
  if(id === '62b75aec1bf596f893abd5a3'){
       
    navigate('https://dashboard.payze.io/shop/3052/04e1826a-256c-4fe7-9f30-2454caa03877')
   
  }else if(id ==='62b75aec1bf596f893abd5a4'){
   navigate('https://dashboard.payze.io/shop/3052/8039515a-34ad-4962-998b-3d21f6e3b09c')
  }else if(id ==='62b75aec1bf596f893abd5a5'){
    navigate('https://dashboard.payze.io/shop/3052/f5b64951-d52e-41a7-8f10-9ae21f532bff')
   }else if(id ==='62b75aec1bf596f893abd5a6'){
    navigate('https://dashboard.payze.io/shop/3052/44b7936e-5a15-4745-8477-e8bf3dfe7223')
   }
}